** Configuration

#+begin_src emacs-lisp :tangle yes

;; Set the defualt location for the code todos org file.
;; By default this is put in the projectile project root for the project of a given source file.
(setq org-collect-code-todos-file "~/org/code-todos.org")


;; Set the key for toggling TODO state in source code and jumping to the org entry
(map! :map org-collect-code-todos-buffer-mode-map
      :n "C-c C-t" #'org-collect-code-todos-toggle-todo-state
      :n "C-c C-s" #'org-collect-code-todos-schedule
      :n "C-c C-d" #'org-collect-code-todos-deadline
      :n "C-c C-j" #'org-collect-code-todos-goto-org-todo)

;; Optionally, configure the comment prefixes.
;; Example of changing markdown-mode to use # instead of <!--:
(setq org-collect-code-todos-comment-prefixes
      (append (assq-delete-all 'markdown-mode org-collect-code-todos-comment-prefixes)
             '((markdown-mode . "#"))))

;; Enable debug logging if needed
(setq org-collect-code-todos-debug t)

;; Show informational messages during operations
(setq org-collect-code-todos-verbose t)

;; Customize the length of TODO IDs (default is 10)
(setq org-collect-code-todos-id-length 8)  ; shorter IDs
#+end_src

#+RESULTS:
: ((emacs-lisp-mode . ;;) (python-mode . #) (c-mode . //) (c++-mode . //) (java-mode . //) (js-mode . //) (css-mode . /*) (html-mode . <!--) (markdown-mode . #))

